

#include <iostream>
#include <cmath>
int main()
{
    //Целочисленные типы
    short sh = -12; // -2^15 ... 2^15-1
    unsigned short sh1 = 134; // 0 ... 2^16-1
    int in = 2344; // -2^31 ... 2^31-1
    unsigned int in1 = 3562; // 0 ... 2^32-1
    long l = -2563; // -2^31 ... 2^31-1
    long long ll = -2345678; // -2^63 ... 2^63-1
    unsigned long long ll1 = 4566; // 0 ... 2^64-1
    //Вещественные значения
    float f = 345.3; // 3,4E +/-38 (7 значащих цифр)
    double d = 256.678; // 1,7E +/- 308 (15 значащих цифр)


    setlocale(LC_ALL, "Rus");
    std::cout << "Введите длины трех сторон треугольника\n";
    unsigned int x, y, z;
    //unsigned int целые неотрицательные числа 0 ... 2^32-1
    std::cin >> x >> y >> z;
    double p;
    //float вещественные числа до 7 значащих цифр
    //2^32=4294967296 ((2^32)*3)/2=12 884 901 888/2=6 442 450 944(10 значащих цифр)
    p = ((x + y + z) / 2);
    double s = sqrt(p * (p - x) * (p - y) * (p - z));
    //double вещественное число двойной точности
    std::cout << "Площадь треугольника равна " << s;
}